# AreIntermediateColorsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings..::..AreIntermediateColorsValid Method
AnalysisDisplayColorSettings Class See Also
---
Verify intermediate color entries
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry> map
)
```

Visual Basic
---
```text
Public Function AreIntermediateColorsValid ( _
	map As IList(Of AnalysisDisplayColorEntry) _
) As Boolean
```

Visual C++
---
```text
public:
bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry^>^ map
)
```

# ### Parameters
map
    Type: System.Collections.Generic..::..IList<(Of <(<'AnalysisDisplayColorEntry>)>)> Array of intermediate color entries.
# ### Return Value
True if intermediate colors are valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace